{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "sagteam/xlm-roberta-large-sag",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": [
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23
  ],
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query",
    "key"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}